

#include <bits/types/FILE.h>
#include <stdio.h>
#include <bits/stdint-uintn.h>
#include <stdbool.h>
#include <string.h>

static unsigned int cp1251_data[128] = {
  // cp1251
  1026, 1027, 8218, 1107, 8222, 8230, 8224, 8225, 8364, 8240, 1033, 8249, 1034, 1036, 1035, 1039,
  1106, 8216, 8217, 8220, 8221, 8226, 8211, 8212, 9888, 8482, 1113, 8250, 1114, 1116, 1115, 1119,
  160, 1038, 1118, 1032, 164, 1168, 166, 167, 1025, 169, 1028, 171, 172, 173, 174, 1031, 176,
  177, 1030, 1110, 1169, 181, 182, 183, 1105, 8470, 1108, 187, 1112, 1029, 1109, 1111, 1040, 1041,
  1042, 1043, 1044, 1045, 1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055, 1056, 1057,
  1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067, 1068, 1069, 1070, 1071, 1072, 1073,
  1074, 1075, 1076, 1077, 1078, 1079, 1080, 1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089,
  1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1102, 1103
};

static unsigned int iso_8859_5_data[128] = {
        128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
        144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159,
        160, 1025, 1026, 1027, 1028, 1029, 1030, 1031, 1032, 1033, 1034, 1035, 1036, 173, 1038, 1039,
        1040, 1041, 1042, 1043, 1044, 1045, 1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055,
        1056, 1057, 1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067, 1068, 1069, 1070, 1071,
        1072, 1073, 1074, 1075, 1076, 1077, 1078, 1079, 1080, 1081, 1082, 1083, 1084, 1085, 1086, 1087,
        1088, 1089, 1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1102, 1103,
        8470, 1105, 1106, 1107, 1108, 1109, 1110, 1111, 1112, 1113, 1114, 1115, 1116, 1117, 1118, 1119
};

static unsigned int koi8_data[128] = {
        9472, 9474, 9484, 9488, 9492, 9496, 9500, 9508, 9516, 9524, 9532, 9600, 9604, 9608, 9612, 9616,
        9617, 9618, 9619, 8992, 9632, 8729, 8730, 8776, 8804, 8805, 160, 8993, 176, 178, 183, 247,
        9552, 9553, 9554, 1105, 9555, 9556, 9557, 9558, 9559, 9560, 9561, 9562, 9563, 9564, 9565, 9566,
        9567, 9568, 9569, 1025, 9570, 9571, 9572, 9573, 9574, 9575, 9576, 9577, 9578, 9579, 9580, 169,
        1102, 1072, 1073, 1094, 1076, 1077, 1092, 1075, 1093, 1080, 1081, 1082, 1083, 1084, 1085, 1086,
        1087, 1103, 1088, 1089, 1090, 1091, 1078, 1074, 1100, 1099, 1079, 1096, 1101, 1097, 1095, 1098,
        1070, 1040, 1041, 1062, 1044, 1045, 1060, 1043, 1061, 1048, 1049, 1050, 1051, 1052, 1053, 1054,
        1055, 1071, 1056, 1057, 1058, 1059, 1046, 1042, 1068, 1067, 1047, 1064, 1069, 1065, 1063, 1066
};

void encode(FILE *targetFile, unsigned int utf8_ch1);

int main(int argc, char *argv[])
{
    if (argc != 4)
    {
        return 1;
    }

    FILE *sourceFile = fopen(argv[1], "rb");
    if (sourceFile == NULL)
    {
        perror("Ошибка открытия файла в исходной кодировке");
    }

    FILE *targetFile = fopen(argv[3], "wb");
    if (targetFile == NULL)
    {
        perror("Ошибка открытия результирующего файла в UTF-8");
    }

    uint8_t ch;
    unsigned int temp_ch;
    bool isContinue = true;
    while (isContinue)
    {
        fread(&ch, sizeof(uint8_t), 1, sourceFile);

        if (ch <= 0x7f) {
            fwrite(&ch, sizeof(uint8_t), 1, targetFile);
        } else {
            if (strcmp(argv[2], "cp1251") == 0)
            {
               temp_ch = cp1251_data[ch-128];
               // дальнейшие преобразования одинаковы для всех кодировок, их можно вынести из if проверки кодировки,что бы не повторять для каждой
                encode(targetFile, temp_ch);
            }
            else if (strcmp(argv[2], "koi8") == 0)
            {
                temp_ch = koi8_data[ch - 128];
                encode(targetFile, temp_ch);
            } else if (strcmp(argv[2], "iso8859-5") == 0)
            {
                temp_ch = iso_8859_5_data[ch - 128];
                encode(targetFile, temp_ch);
            }
        }


        if (feof(sourceFile))
        {
            isContinue = false;
        }
    }

    fclose(sourceFile);
    fclose(targetFile);
    return 0;
}

void encode(FILE *targetFile, unsigned int utf8_ch1) {
    if (utf8_ch1 < 0x800) {
        fputc(0xC0 |utf8_ch1 >> 6, targetFile);
    } else if (utf8_ch1 < 0x8000){
        // преобразуем в 3 байта и также записываем в файл
        fputc(0xE0 |utf8_ch1 >> 12, targetFile);
        fputc(0x80 | (utf8_ch1 >> 6 & 0x3F), targetFile);
    }
     else{
         // преобразуем в 4 айта и также записываем в файл
        fputc(0xF0 |utf8_ch1 >> 18, targetFile);
        fputc(0x80 | (utf8_ch1 >> 12 & 0x3F), targetFile);
        fputc(0x80 | (utf8_ch1 >> 6 & 0x3F), targetFile);
     }
    fputc(0x80 | (utf8_ch1 & 0x3F), targetFile);
}
